## python -m pip install pygame
import pygame

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# در این مثال ساده یک توپ داریم که فقط بین بالا و پایین صفحه حرکت میکند

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# یک پنجره میسازیم و عنوان و سایز آن را مشخص میکنیم
screen = pygame.display.set_mode((500, 500))
pygame.display.set_caption("Our Simple Game Part1")
clock = pygame.time.Clock()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# جای توپ در کجاست و با چه سرعتی در چه جهتی جرکت میکند؟ +۱۰ به
# معنای حرکت ۱۰ واحد به سمت پایین و -۱۰ به معنای حرکت ۱۰ واحدی
# به سمت بالا است
x, y, y_movement = 245, 245, +10

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# یک حلقه نامحدود داریم که در هر چرخه رویدادهای بازی را بررسی کرده
# منطق بازی را بروزرسانی میکند و همینطور صفحه بازی را دوباره رسم
# میکند
done = False
while not done:
    for event in pygame.event.get():
        if event.type == pygame.QUIT:
            done = True

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    # ۶۰ فریم در ثانیه
    clock.tick(60)

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    # پاکسازی صفحه با یک رنگ دلخواه
    screen.fill((255, 0, 127))

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    # قسمتی از منطق بازی در اینجا قرار دارد -تصمیم میگیریم که توپ
    # باید به سمت بالا حرکت کند یا پایین و آیا به بالا یا پایین صفحه
    # رسیده است یا خیر
    y += y_movement
    if y > 500 or y < 0:
        y -= y_movement
        y_movement = -y_movement

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    # در اخر با مختصات جدید بر روی صفحه یک دایره رسم میکنیم
    pygame.draw.circle(screen, (127, 255, 0), (x, y), 10)
    pygame.display.update()
