import random
from tkinter import *

window = Tk()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# برنامه قبلی را کمی توسعه دادیم
# به این صورت که اگر بر روی یک دکمه کلیک کنیم یکی از سه مقدار
# "سنگ"، "کاغذ" یا "قیچی"
# بر روی دکمه نمایش داده میشود
# آیا میتوانید کاری کنید که بجای مقادیر فارسی، مقادیر انگلیسی
# هم معنا نمایش داده شود؟
# راهنمایی:
# میتوانید لیست
# choices
# را بصورت مستقیم تغییر دهید اما در صورت امکان از تابع
# replace
# استفاده کنید
###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
choices = ["سنگ", "کاغذ", "قیچی"]

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
def choose_one():
    my_choice = random.choice(choices)
    button.config(text=str(my_choice))


###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
button = Button()
button.config(text="کلیک کنید")
button.config(command=choose_one)
button.pack()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
window.mainloop()
