from tkinter import *

window = Tk()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# این نرم افزار نام رنگ را به انگلیسی از شما دریافت و در صورتی
# که در لیستش موجود باشه به شما نمایش می دهد
# آیا می توانید به لیست رنگهای این برنامه چند رنگ دیگر اضافه کنید؟
# آیا نرم افزار با رنگ های جدید شما به خوبی کار می کند؟
# در مورد کدهای رنگی هگز تحقیق کنید

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
window.geometry("250x110")
window.title("نرم افزار تشخیص نام رنگ")

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# این کامپوننت این اجازه را به ما میدهد که بتوانیم در یک
# نرم افزار گرافیکی یک متن وارد کنیم
# میخواهیم نام رنگ را در این کامپوننت وارد کنیم
entry = Entry()
entry.place(x=10, y=15, width=230)

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
colors = ["red", "green", "blue", "orange", "yellow", "white", "black"]

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# زمانیکه بر روی دکمه کلیک شود این تابع صدا زده میشود
def check_color():
    color_name = entry.get()
    print(color_name)

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    # بررسی میکنیم آیا رنگی که نام آن وارد شده در لیست ما موجود
    # است یا خیر
    if color_name.lower() in colors:
        label.config(text="یک رنگ است" + " " + color_name.capitalize())
        label.config(bg=color_name)
    else:
        label.config(text="رنگ مورد نظر قابل تشخیص نیست")
        label.config(bg="white")


###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# یک دکمه ساختیم؛ میخواهیم زمانیکه بر روی این دکمه کلیک میشود
# نام رنگ تشخیص داده شود
button = Button()
button.config(text="کلیک کنید")
button.config(command=check_color)
button.place(x=10, y=45, width=230)

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# برچسبی ساختیم که نام و رنگ را با آن نمایش دهیم
label = Label()
label.config(text="ابتدا نام رنگ را وارد کنید")
label.place(x=10, y=75, width=230)

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
window.mainloop()
