import random

# آیا میتوانید یک پاپیون افقی یا عمودی به این لیست اضافه کنید؟
# آیا میتوانید طول و عرض یک مربع را از ورودی بگیرید و آن را رسم کنید؟
# توضیح دهید آخرین بلاک این برنامه چکار میکنید؟
###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
for i in range(6):
    print("*" * i)


print()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
N = 6
for i in range(N):
    print(" " * (N - i) + "*" * i)


print()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
for i in [1, 3, 5, 7]:
    print(("*" * i).center(7))


print()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
for i in [7, 5, 3, 1]:
    print(("*" * i).center(7))

print()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
for i in range(random.randint(5,10)):
    print(("*" * random.choice([1,3,5,7])).center(7))

print()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
"""
*
**
***
****
*****


     *
    **
   ***
  ****
 *****

   *
  ***
 *****
*******

*******
 *****
  ***
   *

*******
 *****
 *****
  ***
   *
 ***** 
  ***
   *
   *
   *
"""