l = list([2, 4, 6, 8, 10])
t = tuple([1, 3, 5, 7, 9, 10])
s = set([1, 2, 3, 10, 10, 10])
d = dict([("w1", 80), ("w2", 85), ("w3", 88)])

print(l, type(l))
print(t, type(t))
print(s, type(s))
print(d, type(d))

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# مساله 1
# ---------------------------------------------------------------
# راهنمایی
# ---------------------------------------------------------------
# لیست را به توپل تبدیل کرده و در یک متغیر جدید بریزید سپس هر
# دو توپل را با هم جمع کنید
# ---------------------------------------------------------------
"""
مقدار لیست و توپل  بالا را با هم جمع کنید بصورتی 
که خروجی آنها بصورت زیر باشد
(1, 3, 5, 7, 9, 10, 2, 4, 6, 8, 10)

"""

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# مساله 2
# ---------------------------------------------------------------
# راهنمایی
# ---------------------------------------------------------------
# set(), list(), .sort()
# ---------------------------------------------------------------
"""
(1, 3, 5, 7, 9, 10, 2, 4, 6, 8, 10)
از این توپل به هر شکلی که میتوانید ایتم های اضافی را شناسایی
و حذف کرده و سپس لیست مرتب شده را نمایش دهید، خروجی کد شما به
صورت زیر خواهد شد
دقت کنید که دیتا تایپ خروجی حتما دوباره به توپل تبدیل شود
(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
"""


###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# مساله 4
# ---------------------------------------------------------------
# راهنمایی
# ---------------------------------------------------------------
# set(), .union(), .intersection()
# ---------------------------------------------------------------
"""
لیست و توپل اول این فایل را به ست تبدیل کنید و اجتماع و اشتراک
آنها را بدست آورید خروجی به صورت زیر خواهد شد
Union:
{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}
Intersection:
{10}
"""


###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# مساله 5
# ---------------------------------------------------------------
# راهنمایی
# ---------------------------------------------------------------
# for (key, value) in d.items():
#     print(key, value)
#     d[key] *= 10
#     print(key, d[key])
# ---------------------------------------------------------------
"""
مقادیر
w1, w2, w3
را با هم جمع کرده و میانگین انها را نمایش دهید
Mean:
84.33
"""