from tkinter import *

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# این برنامه یک دیکشنری ساده است که می تواند رنگهای انگلیسی را به
# فارسی ترجمه کند

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# تمرین ۱
# به این دیکشنری ۶ کلمه دیگر اضافه کنید

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# تمرین ۲
# کدی بنویسید که جای کلیدها و مقادیر را در دیکشنری با هم جابجا کند
# بعد از آن برنامه را تست کنید که بتواند کلمات فارسی را به انگلیسی
# ترجمه کند

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# تمرین ۳
# برای حل این تمرین نیاز است که ابتدا تمرین ۲ را حل کنید
# در این زمان برنامه شما به گونه ای تغییر کرده که میتواند کلمات
# فارسی را به انگلیسی ترجمه کند
# 
# اگر به جای «آبی» فردی مقدار «ابی» را وارد کند - آیا برنامه به 
# درستی میتواند ترجمه کند؟ راه حل چیست؟
# اگر فردی به جای «مشکی» مقدار «سیاه» را وارد کند - آیا برنامه به 
# درستی میتواند ترجمه کند؟ راه حل چیست؟

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# سوال ۴
# برنامه را به شکلی تغییر دهید که اگر کلمه مورد نظر در دیکشنری
# وجود نداشت، بر روی برچسب بنویسد «کلمه موجود نیست»

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# سوال ۵
# سوال ۴ را به گونه ای تغییر دهید که پیام گرافیکی نمایش دهد

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
my_dictionary = {
    "red": "قرمز",
    "blue": "آبی",
    "green": "سبز",
    "black": "مشکی",
    "white": "سفید",
    "yellow": "زرد",
    "orange": "نارنجی",
}

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# این فانکشن کلمه ای که وارد کرده ایم را دریافت کرده، آن را ترجمه
# کرده و نمایش میدهد
def translate():
    word = txt.get().strip().lower()
    if word in my_dictionary.keys():
        lbl.config(text=my_dictionary[word])
    print(word)

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# یک پنجره گرافیکی میسازیم، عنوان و سایز آن را مشخص میکنیم
win = Tk()
win.title("نرم افزار دیکشنری")
win.geometry("350x100")

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# یک ورودی برای متن میسازیم تا بتوانیم کلماتی که قرار است ترجمه
# شوند را از کاربر دریافت کنیم
txt = Entry(win)
txt.pack()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# یک برچسب میسازیم که کاربر بتواند ترجمه کلمه را در آن ببیند
lbl = Label(win, text="معنا")
lbl.pack()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# دکمه ای میسازیم که کاربر بتواند با کلیک بر روی آن یک کلمه را
# ترجمه کند
btn = Button(win, text="ترجمه", command=translate)
btn.pack()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# برنامه را اجرا میکنیم
win.mainloop()