# Simple Interpreter

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# میخواهیم یک مفسر ساده برای یک زبان برنامه نویسی فرضی بسازیم
# خط زیر یک برنامه فرضی است که با زبان فرضی ما نوشته شده است
code = """
    let  ax,8       # it means ax =8
    let  bx,4       # it means bx =4
    add  ax,5       # it means ax+=5
    ech  ax,1       # it means print(ax) 1 time
    sub  ax,2       # it means ax-=2
    ech  ax,3       # it means print(ax) 3 time
"""
print(code)

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# کد برنامه را بر اساس خط ها جدا میکنیم
lines = code.splitlines()
for line in lines:
    print(line)

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# خطهای برنامه را جدا کردیم اما تمیز نیستند
# کامنت و فاصله اضافی وجود دارد
# پس در این مرحله خطوط کد را پاکسازی میکنیم
for i in range(len(lines)):
    lines[i] = lines[i].strip()
    lines[i] = lines[i].replace("  ", " ")
    if "#" in lines[i]:
        lines[i] = lines[i].split("#")[0].strip()
    print(lines[i])

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# خروجی برنامه تا این لحظه به صورت زیر خواهد بود
"""
let ax,8
add ax,5
ech ax,1
sub ax,2
ech ax,3
"""

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# نیاز داریم مقدار متغیر های زبان برنامه نویسی فرضی خود را در
# جایی ذخیره کنیم
variables = {"ax": None, "bx": None}

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# در مرحله بعد اجزای کد را از هم جدا کرده و انها را خط به خط
# اجرا میکنیم
print()
for i in range(len(lines)):
    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    if lines[i].strip() == "":
        continue

    print("-" * 50)
    command = lines[i].split(" ")
    operand = command[1].split(",")
    opr = command[0]
    op1 = operand[0]
    op2 = operand[1]
    print(f"Line {i}: [{lines[i]}] -> [{opr} | {op1} | {op2}] -> {variables}")

    
    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    # محاسبه دستورات زبان برنامه نویسی فرضی ما
    if opr == "ech":
        for i in range(int(op2)):
            print(variables[op1])

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    elif opr == "let":
        variables[op1] = int(op2)
        print(f"{op1} assigned")

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    elif opr == "add":
        variables[op1] += int(op2)
        print(f"{op1} changed")

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    elif opr == "sub":
        variables[op1] -= int(op2)
        print(f"{op1} changed")


###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# خروجی برنامه
"""
--------------------------------------------------
Line 1: [let ax,8] -> [let | ax | 8] -> {'ax': None, 'bx': None}
ax assigned
--------------------------------------------------
Line 2: [let bx,4] -> [let | bx | 4] -> {'ax': 8, 'bx': None}
bx assigned
--------------------------------------------------
Line 3: [add ax,5] -> [add | ax | 5] -> {'ax': 8, 'bx': 4}
ax changed
--------------------------------------------------
Line 4: [ech ax,1] -> [ech | ax | 1] -> {'ax': 13, 'bx': 4}
13
--------------------------------------------------
Line 5: [sub ax,2] -> [sub | ax | 2] -> {'ax': 13, 'bx': 4}
ax changed
--------------------------------------------------
Line 6: [ech ax,3] -> [ech | ax | 3] -> {'ax': 11, 'bx': 4}
11
11
11
"""

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# سوال
# آیا میتوانید یک عملیات دیگر مثلا عملیات ضرب یا تقسیم به این
# برنامه اضافه کنید؟
