from tkinter import *

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# این برنامه یک ابزار نقاشی در ساده ترین حالت ممکن است
# آیا میتوانید این برنامه را اجرا و تست کنید؟
# آیا میتوانید سایز خطی که در برنامه رسم میشود را تغییر دهید؟
# آیا میتوانید رنگ خطی که در برنامه رسم میشود را تغییر دهید؟
# چه تغییر دیگری میتوانید در این برنامه ایجاد کنید؟

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
x, y = None, None


###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
def mouse_click(e):
    global x, y
    x, y = e.x, e.y


def mouse_move(e):
    global x, y
    boom.create_line(x, y, e.x, e.y, width=5, fill="red")
    x, y = e.x, e.y


###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
window = Tk()
Label(window,text="بر روی صفحه نقاشی کنید").pack()
boom = Canvas(width=500, height=500)
boom.pack()
window.bind("<ButtonPress-1>", mouse_click)
window.bind("<B1-Motion>", mouse_move)

window.mainloop()
