from tkinter import *
from tkinter import messagebox
###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# این نرم افزار یک دفترچه تلفن خیلی ساده گرافیکی است
# فعلا در این نسخه فقط نام و شماره تلفن گرفته شده و در لیستی
# وارد میشود
# این اطلاعات فعلا ذخیره نمیشوند
# اگر با این برنامه کار کنید متوجه میشوید که اگر بجای وارد
# کردن یک شماره تلفن یک اسم یا موارد دیگر وارد کنید برنامه
# کماکان کار میکند
# آیا میتوانید برنامه را به شکلی تغییر دهید که در صورتی که
# بجای شماره تلفن یک نام یا محتوای اشتباه وارد شود به کاربر
# اخطار دهد که شماره تلفن اشتباه وارد شده است؟

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# این یک دیکشنری است که اطلاعات تلفن را در خود ذخیره کرده است
phone_book = {"00000": "خواهرم", "00001": "برادرم"}

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# این یک تابع است که پس از هر بار اجرا، محتوای لیست را خالی
# کرده و سپس دوباره لیست را با اطلاعات دفترچه تلفن پر میکند
def show_phone_book_in_list():
    phone_book_list.delete(0, END)
    for phone in phone_book:
        phone_book_list.insert("end", f"{phone}  -  {phone_book[phone]}")


###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# زمانیکه بر روی دکمه افزودن کلیک میکنید، این تابع صدا زده
# میشود؛ در صورتی که نام یا شماره تلفن خالی باشد به کاربر
# اخطار داده میشود؛ در عیر اینصورت دفترچه تلفن بروز شده، لیست
# شماره ها پاک شده و از نو مقداردهی میشود؛ سپس یک پیغام به
# کاربر داده میشود
def add_phone_number_to_phone_book():
    _name = name.get().strip()
    _phone = phone.get().strip()

    if _name == "" or _phone == "":
        messagebox.showerror("خطا", "باید هر دو نام و شماره را وارد کنید")
    else:
        phone_book[name.get()] = phone.get()
        show_phone_book_in_list()
        messagebox.showinfo("موفق", "اطلاعات با موفقیت افزوده شد")


###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# پنجره برنامه را میسازیم، عنوان آن را انتخاب میکنیم و طول و
# عرض آن را مشخص میکنیم
# آیا میتوانید عنوان پنجره و طول و عرض آن را تغییر دهید؟
window = Tk()
window.title("دفترچه تلفن")
window.geometry("250x300")

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# ابتدا یک برچسب میسازیم که مقدار نام را نمایش میدهد سپس یک
# انتری میسازیم که میتواند مقدار نام را در خود قرار دهد
Label(window, text="نام").pack()
name = Entry(window)
name.pack()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# ابتدا یک برچسب میسازیم که مقدار تلفن را نمایش میدهد سپس یک
# انتری میسازیم که میتواند مقدار شماره تلفن را در خود قرار دهد
Label(window, text="تلفن").pack()
phone = Entry(window)
phone.pack()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# یک دکمه ساختیم که بتوانیم با کلیک بر روی آن نام وشماره تلفن
# را به دفترچه و همینطور لیست اضافه کنیم
add_button = Button(window, text="افزودن", command=add_phone_number_to_phone_book)
add_button.pack()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# این یک لیست است که هر سطر آن قابل انتخاب شدن است
# این لیست قرار است اطلاعات تلفن را در خود نمایش دهد
phone_book_list = Listbox(window)
phone_book_list.pack()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# در ابتدای برنامه، لیست را با شماره تلفن های پیشفرض پر میکنیم
show_phone_book_in_list()
window.mainloop()
