## python -m pip install pygame
import pygame
import random

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# در اینجا نسخه اول بازی را به شکلی تغییر دادیم که یک توپ در صفحه
# بصورت تصادفی به سمت یک نقطه جدید حرکت کند - هر بار توپ به نقطه
# مد نظر میرسد یک نقطه جدید تصادفی دیگر ساخته میشود تا مسیر جدیدی
# باشد که توپ به سمت آن حرکت میکنم

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# یک پنجره میسازیم و عنوان و سایز آن را مشخص میکنیم
screen = pygame.display.set_mode((500, 500))
pygame.display.set_caption("Our Simple Game Part2")
clock = pygame.time.Clock()

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# مشخص میکنیم توپ در کجای صفحه قرار دارد و به چه نقطه جدیدی باید
# تغییر مسیر دهد و با چه سرعتی باید به آن سمت حرکت کند
x, y = 250, 250
nx, ny = None, None
nxp, nyp = None, None
speed = 5

###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# یک حلقه نامحدود داریم که در هر چرخه رویدادهای بازی را بررسی کرده
# منطق بازی را بروزرسانی میکند و همینطور صفحه بازی را دوباره رسم
# میکند
done = False
while not done:
    for event in pygame.event.get():
        if event.type == pygame.QUIT:
            done = True

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    # ۶۰ فریم در ثانیه
    clock.tick(60)

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    # پاکسازی صفحه با یک رنگ دلخواه
    screen.fill((255, 0, 127))

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    # اگر این شرط برقرار باشد یعنی توپ به مکانی که باید به سمت آن
    # حرکت میکرده رسیده است و باید یک نقطه جدید تصادفی در صفحه
    # انتخاب کنیم که توپ به آن سمت حرکت کند
    if nx is None and ny is None:
        nxp = nx = random.randint(0, 500)
        nyp = ny = random.randint(0, 500)

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    # میخواهیم توپ به سمت یک مکان جدید حرکت کند
    # تصمیم میگیریم بر روی محور ایکس چقدر حرکت کنیم تا به مختصات
    # مد نظر برسیم
    if nx is not None:
        if x < nx - speed:
            x += speed
        elif x > nx + speed:
            x -= speed
        else:
            x = nx
            nx = None

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    # میخواهیم توپ به سمت یک مکان جدید حرکت کند
    # تصمیم میگیریم بر روی محور وآی چقدر حرکت کنیم تا به مختصات
    # مد نظر برسیم
    if ny is not None:
        if y < ny - speed:
            y += speed
        elif y > ny + speed:
            y -= speed
        else:
            y = ny
            ny = None

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    # در اخر با مختصات جدید بر روی صفحه دایره رسم میکنیم
    pygame.draw.circle(screen, (127, 255, 0), (x, y), 10)

    ###~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    # یک دایره کوچکتر رسم میکنیم که جایی را نمایش میدهد که توپ
    # اصلی باید به سمت آن حرکت کند
    pygame.draw.circle(screen, (255, 255, 255), (nxp, nyp), 5)
    pygame.display.update()
